In [14]:
!pip install "pymongo[srv]"

Requirement already satisfied: pymongo[srv] in /Users/ajinkyapawale/opt/anaconda3/lib/python3.8/site-packages (3.12.1)
Collecting dnspython<3.0.0,>=1.16.0; extra == "srv"
  Downloading dnspython-2.1.0-py3-none-any.whl (241 kB)
     |████████████████████████████████| 241 kB 5.7 MB/s eta 0:00:01
Installing collected packages: dnspython
Successfully installed dnspython-2.1.0

In [2]:
import pandas as pd
from urllib.parse import quote
import numpy as np
from pymongo import MongoClient
from dns import resolver
import certifi
ca = certifi.where()

In [3]:
data = pd.read_csv('all_stocks_5yr.csv')

In [4]:
data.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [130]:
data.tail()

              date   open   high    low  close   volume Name  diff
619035  2018-02-01  76.84  78.27  76.69  77.82  2982259  ZTS  1.58
619036  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS  1.39
619037  2018-02-05  76.64  76.92  73.18  73.83  2962031  ZTS  3.74
619038  2018-02-06  72.74  74.56  72.13  73.27  4924323  ZTS  2.43
619039  2018-02-07  72.70  75.00  72.69  73.86  4534912  ZTS  2.31

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619040 non-null  object
 1   open    619029 non-null  float64
 2   high    619032 non-null  float64
 3   low     619032 non-null  float64
 4   close   619040 non-null  float64
 5   volume  619040 non-null  int64
 6   Name    619040 non-null  object
dtypes: float64(4), int64(1), object(2)
memory usage: 33.1+ MB

In [7]:
data['Name'].value_counts()

C       1259
TAP     1259
PSX     1259
FISV    1259
EQR     1259
        ...
DXC      215
BHGE     152
BHF      143
DWDP     109
APTV      44
Name: Name, Length: 505, dtype: int64

In [129]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db = client['DB_Stock']
col = db['Record_Stock']
#data.reset_index(inplace=True)
data_dict = data.to_dict("records")
# Insert collection
col.insert_many(data_dict)

In [70]:
list(col.find())[:10]

[{'_id': ObjectId('6196af97a87a68a43adef63b'),
  'date': '2013-02-08',
  'open': 15.07,
  'high': 15.12,
  'low': 14.63,
  'close': 14.75,
  'volume': 8407500,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef63c'),
  'date': '2013-02-11',
  'open': 14.89,
  'high': 15.01,
  'low': 14.26,
  'close': 14.46,
  'volume': 8882000,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef63d'),
  'date': '2013-02-12',
  'open': 14.45,
  'high': 14.51,
  'low': 14.1,
  'close': 14.27,
  'volume': 8126000,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef63e'),
  'date': '2013-02-13',
  'open': 14.3,
  'high': 14.94,
  'low': 14.25,
  'close': 14.66,
  'volume': 10259500,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef63f'),
  'date': '2013-02-14',
  'open': 14.94,
  'high': 14.96,
  'low': 13.16,
  'close': 13.99,
  'volume': 31879900,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef640'),
  'date': '2013-02-15',
  'open': 13.93,
  'high': 14.61,
  'low': 13.93,
  'close': 14.5,
  'volume': 15628000,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef641'),
  'date': '2013-02-19',
  'open': 14.33,
  'high': 14.56,
  'low': 14.08,
  'close': 14.26,
  'volume': 11354400,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef642'),
  'date': '2013-02-20',
  'open': 14.17,
  'high': 14.26,
  'low': 13.15,
  'close': 13.33,
  'volume': 14725200,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef643'),
  'date': '2013-02-21',
  'open': 13.62,
  'high': 13.95,
  'low': 12.9,
  'close': 13.37,
  'volume': 11922100,
  'Name': 'AAL'},
 {'_id': ObjectId('6196af97a87a68a43adef644'),
  'date': '2013-02-22',
  'open': 13.57,
  'high': 13.6,
  'low': 13.21,
  'close': 13.57,
  'volume': 6071400,
  'Name': 'AAL'}]

**Add new documents, update and delete them**

In [111]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db = client['DB_Stock']
col = db['Record_Stock']

In [39]:
col

Collection(Database(MongoClient(host=['clusterstock-shard-00-02.jw7kb.mongodb.net:27017', 'clusterstock-shard-00-01.jw7kb.mongodb.net:27017', 'clusterstock-shard-00-00.jw7kb.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-13yk0z-shard-0', ssl=True), 'DB_STOCKAPI'), 'DB_STOCKAPI')

In [40]:
client.list_database_names()

['DB_STOCKAPI', 'DB_Stock', 'admin', 'local']

In [44]:
lis = [{'date':"2013-02-08",'open':15.07,'high':15.12,'low':14.63,'close':14.75,'volume':8407500,'Name':"AJN"},
      {'date':"2013-02-09",'open':16.07,'high':18.52,'low':12.83,'close':14.21,'volume':4404800,'Name':"AJN"}]

In [41]:
x = col.insert_many(lis)
print(x)

In [47]:
dic = {'date':"2013-02-09",'open':16.07,'high':18.52,'low':12.83,'close':14.21,'volume':4404800,'Name':"AJN"}

In [48]:
y = col.delete_one(dic)
print(y)

<pymongo.results.DeleteResult object at 0x7f8d30456880>

In [95]:
record_update = {
   'date': '2013-02-08',
    'Name' : 'AAL'
}

In [98]:
col.update_one({'open':15.09},{'$set':record_update})

In [99]:
col.update_one({'close':14.46},{'$set':record_update})

**Add a new field to all the documents**

In [124]:
data['diff'] = data['high'] - data['low']

In [125]:
diff = data['diff'].tolist()

In [128]:
col.update({},{'$set' : {"high-low": diff}},False,True)

<ipython-input-128-80ec125eeb53>:1: DeprecationWarning: update is deprecated. Use replace_one, update_one or update_many instead.
  col.update({},{'$set' : {"high-low": diff}})

{'n': 1,
 'nModified': 1,
 'opTime': {'ts': Timestamp(1637269630, 8), 't': 217},
 'electionId': ObjectId('7fffffff00000000000000d9'),
 'ok': 1.0,
 '$clusterTime': {'clusterTime': Timestamp(1637269630, 10),
  'signature': {'hash': b'\xb5f\t\xfe\xd3\xd0\xd5n\xd1\xd9\xa8\x15\xef<\xb9+\xc1\xe3}\xa2',
   'keyId': 6993535964366766082}},
 'operationTime': Timestamp(1637269630, 8),
 'updatedExisting': True}

**Creating 5 Dbs for FANG stocks**

In [165]:
data_fb = data[data['Name']=='FB']

In [166]:
data_fb = data_fb.reset_index(drop=True)

In [167]:
data_fb

            date    open      high     low     close    volume Name     diff
0     2013-02-08   28.89   29.1700   28.51   28.5450  37662614   FB   0.6600
1     2013-02-11   28.61   28.6800   28.04   28.2600  36979533   FB   0.6400
2     2013-02-12   27.67   28.1600   27.10   27.3700  93417215   FB   1.0600
3     2013-02-13   27.36   28.3200   27.31   27.9075  50100805   FB   1.0100
4     2013-02-14   28.02   28.6300   28.01   28.5000  35581045   FB   0.6200
...          ...     ...       ...     ...       ...       ...  ...      ...
1254  2018-02-01  188.22  195.3200  187.89  193.0900  54211293   FB   7.4300
1255  2018-02-02  192.04  194.2100  189.98  190.2800  26677484   FB   4.2300
1256  2018-02-05  186.93  190.6100  180.61  181.2600  33128206   FB  10.0000
1257  2018-02-06  178.57  185.7700  177.74  185.3100  37758505   FB   8.0300
1258  2018-02-07  184.15  185.0817  179.95  180.1800  27601886   FB   5.1317

[1259 rows x 8 columns]

In [168]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db_fb = client['DB_Stock_FB']
col_fb = db_fb['Record_Stock_FB']

data_dict = data_fb.to_dict("records")
col_fb.insert_many(data_dict)

In [169]:
data_apl = data[data['Name']=='AAPL']

In [170]:
data_apl = data_apl.reset_index(drop=True)

In [171]:
data_apl

,date,open,high,low,close,volume,Name,diff
0,2013-02-08,67.7142,68.4014,66.8928,67.8542,158168416,AAPL,1.5086
1,2013-02-11,68.0714,69.2771,67.6071,68.5614,129029425,AAPL,1.6700
2,2013-02-12,68.5014,68.9114,66.8205,66.8428,151829363,AAPL,2.0909
3,2013-02-13,66.7442,67.6628,66.1742,66.7156,118721995,AAPL,1.4886
4,2013-02-14,66.3599,67.3771,66.2885,66.6556,88809154,AAPL,1.0886
...,...,...,...,...,...,...,...,...
1254,2018-02-01,167.1650,168.6200,166.7600,167.7800,47230787,AAPL,1.8600
1255,2018-02-02,166.0000,166.8000,160.1000,160.5000,86593825,AAPL,6.7000
1256,2018-02-05,159.1000,163.8800,156.0000,156.4900,72738522,AAPL,7.8800
1257,2018-02-06,154.8300,163.7200,154.0000,163.0300,68243838,AAPL,9.7200
1258,2018-02-07,163.0850,163.4000,159.0685,159.5400,51608580,AAPL,4.3315

In [172]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db_appl = client['DB_Stock_Apple']
col_appl = db_appl['Record_Stock_Apple']

data_dict = data_apl.to_dict("records")
col_appl.insert_many(data_dict)

In [173]:
data_nflx = data[data['Name']=='NFLX']

data_nflx = data_nflx.reset_index(drop=True)

data_nflx

,date,open,high,low,close,volume,Name,diff
0,2013-02-08,25.9635,26.2800,25.7157,25.8528,25649820,NFLX,0.5643
1,2013-02-11,25.5685,26.0071,24.9714,25.4128,29321782,NFLX,1.0357
2,2013-02-12,25.8085,26.2228,25.1014,25.4214,34388802,NFLX,1.1214
3,2013-02-13,25.8428,26.6285,25.6657,26.6098,40799094,NFLX,0.9628
4,2013-02-14,26.7557,27.1214,26.3844,26.7714,31968685,NFLX,0.7370
...,...,...,...,...,...,...,...,...
1254,2018-02-01,266.4100,271.9500,263.3800,265.0700,9669011,NFLX,8.5700
1255,2018-02-02,263.0000,270.6200,262.7100,267.4300,9123610,NFLX,7.9100
1256,2018-02-05,262.0000,267.8990,250.0300,254.2600,11896053,NFLX,17.8690
1257,2018-02-06,247.7000,266.7000,245.0000,265.7200,12595801,NFLX,21.7000
1258,2018-02-07,266.5800,272.4500,264.3250,264.5600,8981548,NFLX,8.1250

In [175]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db_netflx = client['DB_Stock_Netflix']
col_netflx = db_netflx['Record_Stock_Netflix']

data_dict = data_nflx.to_dict("records")
col_netflx.insert_many(data_dict)

In [176]:
data_google = data[data['Name']=='GOOGL']
data_google = data_google.reset_index(drop=True)
data_google

,date,open,high,low,close,volume,Name,diff
0,2013-02-08,390.4551,393.7283,390.1698,393.0777,6031199,GOOGL,3.5585
1,2013-02-11,389.5892,391.8915,387.2619,391.6012,4330781,GOOGL,4.6296
2,2013-02-12,391.2659,394.3440,390.0747,390.7403,3714176,GOOGL,4.2693
3,2013-02-13,390.4551,393.0677,390.3750,391.8214,2393946,GOOGL,2.6927
4,2013-02-14,390.2549,394.7644,389.2739,394.3039,3466971,GOOGL,5.4905
...,...,...,...,...,...,...,...,...
1254,2018-02-01,1175.9900,1187.4500,1169.3600,1181.5900,3675709,GOOGL,18.0900
1255,2018-02-02,1127.4200,1131.3000,1111.1700,1119.2000,5892122,GOOGL,20.1300
1256,2018-02-05,1100.6100,1114.9900,1056.7400,1062.3900,4177469,GOOGL,58.2500
1257,2018-02-06,1033.9800,1087.3800,1030.0100,1084.4300,3831524,GOOGL,57.3700
1258,2018-02-07,1084.9700,1086.5300,1054.6200,1055.4100,2597094,GOOGL,31.9100

In [177]:
client =  MongoClient("mongodb+srv://ajinkya30:"+quote('Ajinkya@30')+"@clusterstock.jw7kb.mongodb.net/DB_Stock?retryWrites=true&w=majority")
db_google = client['DB_Stock_Google']
col_google = db_google['Record_Stock_Google']

data_dict = data_google.to_dict("records")
col_google.insert_many(data_dict)

**Connection to Data Lake and Quering results from Data Lake**

In [213]:
client =  MongoClient('mongodb://ajinkya30:'+quote('Ajinkya@30')+'@datalake0-jw7kb.a.query.mongodb.net/Database0?ssl=true&authSource=admin')
db_lake = client['Database0']
col_lake = db_lake['Collection0']

In [214]:
col_lake

Collection(Database(MongoClient(host=['datalake0-jw7kb.a.query.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, ssl=True, authsource='admin'), 'Database0'), 'Collection0')

In [221]:
cur = list(col_lake.find({"Name": "FB"}).limit(5))

In [222]:
cur

[{'_id': ObjectId('6197d041a87a68a43a0e44b1'),
  'date': '2013-03-26',
  'open': 25.08,
  'high': 25.48,
  'low': 25.03,
  'close': 25.205,
  'volume': 26939599,
  'Name': 'FB',
  'diff': 0.4499999999999993},
 {'_id': ObjectId('6197d041a87a68a43a0e44a5'),
  'date': '2013-03-08',
  'open': 28.425,
  'high': 28.47,
  'low': 27.73,
  'close': 27.96,
  'volume': 44167632,
  'Name': 'FB',
  'diff': 0.7399999999999984},
 {'_id': ObjectId('6197d041a87a68a43a0e44a8'),
  'date': '2013-03-13',
  'open': 27.62,
  'high': 27.65,
  'low': 26.92,
  'close': 27.08,
  'volume': 39537298,
  'Name': 'FB',
  'diff': 0.7299999999999969},
 {'_id': ObjectId('6197d041a87a68a43a0e44b5'),
  'date': '2013-04-02',
  'open': 25.77,
  'high': 26.12,
  'low': 25.3,
  'close': 25.42,
  'volume': 35124893,
  'Name': 'FB',
  'diff': 0.8200000000000003},
 {'_id': ObjectId('6197d041a87a68a43a0e44bb'),
  'date': '2013-04-10',
  'open': 27.0099,
  'high': 27.84,
  'low': 26.9,
  'close': 27.57,
  'volume': 45896160,
  'Name': 'FB',
  'diff': 0.9400000000000013}]

In [239]:
cur = list(col_lake.find({"Name" : 'FB','diff':{'$gt':8}}).limit(5))

In [240]:
cur

[{'_id': ObjectId('6197d041a87a68a43a0e4845'),
  'date': '2016-11-10',
  'open': 123.93,
  'high': 124.18,
  'low': 115.27,
  'close': 120.8,
  'volume': 67846704,
  'Name': 'FB',
  'diff': 8.91000000000001},
 {'_id': ObjectId('6197d041a87a68a43a0e4711'),
  'date': '2015-08-24',
  'open': 77.03,
  'high': 87.14,
  'low': 72.0,
  'close': 82.09,
  'volume': 83710727,
  'Name': 'FB',
  'diff': 15.14},
 {'_id': ObjectId('6197d041a87a68a43a0e48d5'),
  'date': '2017-06-09',
  'open': 154.77,
  'high': 155.59,
  'low': 146.61,
  'close': 149.6,
  'volume': 35577676,
  'Name': 'FB',
  'diff': 8.97999999999999},
 {'_id': ObjectId('6197d041a87a68a43a0e497b'),
  'date': '2018-02-06',
  'open': 178.57,
  'high': 185.77,
  'low': 177.74,
  'close': 185.31,
  'volume': 37758505,
  'Name': 'FB',
  'diff': 8.030000000000001},
 {'_id': ObjectId('6197d041a87a68a43a0e497a'),
  'date': '2018-02-05',
  'open': 186.93,
  'high': 190.61,
  'low': 180.61,
  'close': 181.26,
  'volume': 33128206,
  'Name': 'FB',
  'diff': 10.0}]

In [248]:
cur = list(col_lake.aggregate([{'$match': {"diff" :{'$gt': 5}, "Name": 'AAPL'} },{'$count': "Num"}]))

In [249]:
cur

[{'Num': 19}]